backend/load-test/load-test.yml
config:
  target: "http://localhost:3000" # change if your backend runs elsewhere
  processor: "./auth.js"
  phases:
    - duration: 60       # test duration (seconds)
      arrivalRate: 10    # new users per second
      name: "Steady load"
  variables:
    email: "kterto@capyba.com"
    password: "test@123"

  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ token }}"  # optional if you need JWT

scenarios:
  - name: "Generate and download PDF report"
    flow:
      - post:
          url: "/reports/create_report/"
          json:
            start: "2025-10-01"
            end: "2025-10-14"
            status: "all"
            onlyOwnOccurrences: false
          capture:
            - json: "$.jobId"
              as: "jobId"
      - think: 3
      - get:
          url: "/reports/file/{{ jobId }}"
          expect:
            - statusCode: 200